#+TITLE:Day 1: Sonar Sweep

https://adventofcode.com/2021/day/1

* Part 1

** Problem

Count the number of times a depth measurement increases from the previous measurement. (There is no measurement before the first measurement.) In the example above, the changes are as follows:

#+begin_src text
199 (N/A - no previous measurement)
200 (increased)
208 (increased)
210 (increased)
200 (decreased)
207 (increased)
240 (increased)
269 (increased)
260 (decreased)
263 (increased)
#+end_src

In this example, there are 7 measurements that are larger than the previous measurement.

*How many measurements are larger than the previous measurement?*


** Solutions

*** C++

#+begin_src C++ :includes '(<vector> <numeric> <iostream> <map>) :namespaces std :flags -std=c++11 :results verbatim
  #include <iostream>
  #include <fstream>
  using namespace std;

  int increaseCount (const string& filename) {
      int increases = 0;
      ifstream file(filename);

      int previousDepth;
      file >> previousDepth;

      int depth;
      while (file >> depth) {
          cout << previousDepth << "\t" << depth << " ";

          if (depth > previousDepth) {
              ++increases;
              cout << "INCREASE";
          }

          cout << "\n";
          previousDepth = depth;
      }

      return increases;
  }

  int main() {
      cout << increaseCount("example.txt") << "\n";
  }
#+end_src

#+RESULTS:
#+begin_example
199	200 INCREASE
200	208 INCREASE
208	210 INCREASE
210	200
200	207 INCREASE
207	240 INCREASE
240	269 INCREASE
269	260
260	263 INCREASE
7
#+end_example


*** Scala

#+begin_src scala
  import scala.io.Source

  def increaseCount(filename: String) = {
    val bufferedSource = Source.fromFile(filename)

    val result =
      bufferedSource.getLines.
        map(_.toInt).
        sliding(2).
        foldLeft(0)((acc, pair) => {
          print(s"${pair(0)} ${pair(1)} ")

          if (pair(0) < pair(1)) {
            println("INCREASE")
            acc + 1
          }
          else {
            println
            acc
          }
        })

    bufferedSource.close
    result
  }

  println(increaseCount("input.txt"))
#+end_src

*** Elixir


* Part 2

** Problem

Consider sums of a three-measurement sliding window. Again considering the above example:

#+begin_src text
  199  A
  200  A B
  208  A B C
  210    B C D
  200  E   C D
  207  E F   D
  240  E F G
  269    F G H
  260      G H
  263        H
#+end_src

Your goal now is to count the *number of times the sum of measurements in this sliding window increases from the previous sum*. So, compare A with B, then compare B with C, then C with D, and so on. Stop when there aren't enough measurements left to create a new three-measurement sum.

Consider sums of a three-measurement sliding window. *How many sums are larger than the previous sum?*


** Solutions

*** Scala

#+begin_src scala
  import scala.io.Source

  def slidingWindowSumIncreaseCount (filename: String) = {
    val file = Source.fromFile(filename)

    val result =
      file.getLines.toList.
        view.
        map(_.toInt).
        sliding(3).
        map(_.sum).
        sliding(2).
        foldLeft(0)((acc, pair) => {
          if (pair(0) < pair(1))
            acc + 1
          else
            acc
        })

    file.close
    result
  }

  println(slidingWindowSumIncreaseCount("input.txt"))
#+end_src


*** C++

#+begin_src C++ :includes '(<vector> <numeric> <iostream> <map>) :namespaces std :flags -std=c++11 :results verbatim
  #include <iostream>
  #include <fstream>
  using namespace std;

  int increaseCount (const string& filename) {
      int increases = 0;
      ifstream file(filename);

      int a, b, c, d;
      file >> a >> b >> c;
      int previousWindowDepth;
      int curWindowDepth;

      while (file >> d) {
          previousWindowDepth = a + b + c;
          curWindowDepth = previousWindowDepth - a + d;
          cout << previousWindowDepth << " " << curWindowDepth << " ";

          if (curWindowDepth > previousWindowDepth) {
              cout << "INCREASE";
              ++increases;
          }

          cout << "\n";

          // Slide the window one step ahead
          a = b;
          b = c;
          c = d;
      }

      return increases;
  }

  int main() {
      cout << increaseCount("input.txt") << "\n";
  }
#+end_src

#+RESULTS:
#+begin_example
349 376 INCREASE
376 392 INCREASE
392 413 INCREASE
413 446 INCREASE
446 466 INCREASE
466 499 INCREASE
499 524 INCREASE
524 556 INCREASE
556 574 INCREASE
574 584 INCREASE
584 591 INCREASE
591 607 INCREASE
607 628 INCREASE
628 650 INCREASE
650 682 INCREASE
682 740 INCREASE
740 794 INCREASE
794 829 INCREASE
829 862 INCREASE
862 895 INCREASE
895 941 INCREASE
941 966 INCREASE
966 993 INCREASE
993 1006 INCREASE
1006 1013 INCREASE
1013 1036 INCREASE
1036 1076 INCREASE
1076 1117 INCREASE
1117 1139 INCREASE
1139 1147 INCREASE
1147 1155 INCREASE
1155 1191 INCREASE
1191 1223 INCREASE
1223 1267 INCREASE
1267 1308 INCREASE
1308 1349 INCREASE
1349 1379 INCREASE
1379 1384 INCREASE
1384 1392 INCREASE
1392 1398 INCREASE
1398 1415 INCREASE
1415 1430 INCREASE
1430 1448 INCREASE
1448 1463 INCREASE
1463 1491 INCREASE
1491 1523 INCREASE
1523 1554 INCREASE
1554 1572 INCREASE
1572 1593 INCREASE
1593 1604 INCREASE
1604 1612 INCREASE
1612 1610
1610 1618 INCREASE
1618 1646 INCREASE
1646 1675 INCREASE
1675 1697 INCREASE
1697 1704 INCREASE
1704 1718 INCREASE
1718 1746 INCREASE
1746 1777 INCREASE
1777 1793 INCREASE
1793 1803 INCREASE
1803 1819 INCREASE
1819 1853 INCREASE
1853 1879 INCREASE
1879 1894 INCREASE
1894 1896 INCREASE
1896 1899 INCREASE
1899 1911 INCREASE
1911 1936 INCREASE
1936 1975 INCREASE
1975 2023 INCREASE
2023 2060 INCREASE
2060 2092 INCREASE
2092 2120 INCREASE
2120 2148 INCREASE
2148 2186 INCREASE
2186 2209 INCREASE
2209 2240 INCREASE
2240 2251 INCREASE
2251 2262 INCREASE
2262 2265 INCREASE
2265 2268 INCREASE
2268 2285 INCREASE
2285 2304 INCREASE
2304 2359 INCREASE
2359 2388 INCREASE
2388 2424 INCREASE
2424 2424
2424 2436 INCREASE
2436 2441 INCREASE
2441 2435
2435 2429
2429 2421
2421 2440 INCREASE
2440 2470 INCREASE
2470 2500 INCREASE
2500 2508 INCREASE
2508 2496
2496 2485
2485 2478
2478 2471
2471 2452
2452 2451
2451 2461 INCREASE
2461 2487 INCREASE
2487 2498 INCREASE
2498 2509 INCREASE
2509 2534 INCREASE
2534 2577 INCREASE
2577 2608 INCREASE
2608 2624 INCREASE
2624 2631 INCREASE
2631 2650 INCREASE
2650 2669 INCREASE
2669 2680 INCREASE
2680 2689 INCREASE
2689 2696 INCREASE
2696 2703 INCREASE
2703 2747 INCREASE
2747 2801 INCREASE
2801 2862 INCREASE
2862 2903 INCREASE
2903 2930 INCREASE
2930 2949 INCREASE
2949 2951 INCREASE
2951 2956 INCREASE
2956 2956
2956 2976 INCREASE
2976 3001 INCREASE
3001 3041 INCREASE
3041 3069 INCREASE
3069 3093 INCREASE
3093 3117 INCREASE
3117 3136 INCREASE
3136 3158 INCREASE
3158 3180 INCREASE
3180 3206 INCREASE
3206 3228 INCREASE
3228 3237 INCREASE
3237 3253 INCREASE
3253 3275 INCREASE
3275 3300 INCREASE
3300 3316 INCREASE
3316 3336 INCREASE
3336 3349 INCREASE
3349 3357 INCREASE
3357 3342
3342 3333
3333 3333
3333 3359 INCREASE
3359 3389 INCREASE
3389 3436 INCREASE
3436 3470 INCREASE
3470 3504 INCREASE
3504 3508 INCREASE
3508 3520 INCREASE
3520 3541 INCREASE
3541 3529
3529 3514
3514 3486
3486 3496 INCREASE
3496 3502 INCREASE
3502 3515 INCREASE
3515 3527 INCREASE
3527 3537 INCREASE
3537 3547 INCREASE
3547 3555 INCREASE
3555 3563 INCREASE
3563 3577 INCREASE
3577 3591 INCREASE
3591 3603 INCREASE
3603 3607 INCREASE
3607 3619 INCREASE
3619 3633 INCREASE
3633 3640 INCREASE
3640 3646 INCREASE
3646 3652 INCREASE
3652 3662 INCREASE
3662 3676 INCREASE
3676 3691 INCREASE
3691 3705 INCREASE
3705 3717 INCREASE
3717 3728 INCREASE
3728 3741 INCREASE
3741 3747 INCREASE
3747 3757 INCREASE
3757 3770 INCREASE
3770 3787 INCREASE
3787 3802 INCREASE
3802 3833 INCREASE
3833 3860 INCREASE
3860 3897 INCREASE
3897 3914 INCREASE
3914 3933 INCREASE
3933 3942 INCREASE
3942 3952 INCREASE
3952 3970 INCREASE
3970 3989 INCREASE
3989 4005 INCREASE
4005 4000
4000 3994
3994 3967
3967 3959
3959 3952
3952 3967 INCREASE
3967 4004 INCREASE
4004 4034 INCREASE
4034 4079 INCREASE
4079 4095 INCREASE
4095 4139 INCREASE
4139 4179 INCREASE
4179 4220 INCREASE
4220 4248 INCREASE
4248 4266 INCREASE
4266 4285 INCREASE
4285 4300 INCREASE
4300 4315 INCREASE
4315 4335 INCREASE
4335 4346 INCREASE
4346 4358 INCREASE
4358 4362 INCREASE
4362 4368 INCREASE
4368 4374 INCREASE
4374 4380 INCREASE
4380 4386 INCREASE
4386 4389 INCREASE
4389 4383
4383 4387 INCREASE
4387 4393 INCREASE
4393 4408 INCREASE
4408 4415 INCREASE
4415 4437 INCREASE
4437 4444 INCREASE
4444 4462 INCREASE
4462 4468 INCREASE
4468 4498 INCREASE
4498 4522 INCREASE
4522 4539 INCREASE
4539 4547 INCREASE
4547 4550 INCREASE
4550 4555 INCREASE
4555 4548
4548 4539
4539 4540 INCREASE
4540 4557 INCREASE
4557 4575 INCREASE
4575 4587 INCREASE
4587 4597 INCREASE
4597 4616 INCREASE
4616 4643 INCREASE
4643 4678 INCREASE
4678 4720 INCREASE
4720 4746 INCREASE
4746 4764 INCREASE
4764 4766 INCREASE
4766 4777 INCREASE
4777 4786 INCREASE
4786 4800 INCREASE
4800 4816 INCREASE
4816 4833 INCREASE
4833 4845 INCREASE
4845 4850 INCREASE
4850 4877 INCREASE
4877 4892 INCREASE
4892 4902 INCREASE
4902 4898
4898 4907 INCREASE
4907 4919 INCREASE
4919 4938 INCREASE
4938 4966 INCREASE
4966 5001 INCREASE
5001 5034 INCREASE
5034 5079 INCREASE
5079 5119 INCREASE
5119 5145 INCREASE
5145 5146 INCREASE
5146 5148 INCREASE
5148 5172 INCREASE
5172 5198 INCREASE
5198 5224 INCREASE
5224 5225 INCREASE
5225 5230 INCREASE
5230 5246 INCREASE
5246 5271 INCREASE
5271 5297 INCREASE
5297 5311 INCREASE
5311 5337 INCREASE
5337 5358 INCREASE
5358 5380 INCREASE
5380 5415 INCREASE
5415 5454 INCREASE
5454 5492 INCREASE
5492 5499 INCREASE
5499 5513 INCREASE
5513 5547 INCREASE
5547 5581 INCREASE
5581 5607 INCREASE
5607 5617 INCREASE
5617 5627 INCREASE
5627 5631 INCREASE
5631 5632 INCREASE
5632 5635 INCREASE
5635 5642 INCREASE
5642 5650 INCREASE
5650 5673 INCREASE
5673 5710 INCREASE
5710 5745 INCREASE
5745 5765 INCREASE
5765 5774 INCREASE
5774 5808 INCREASE
5808 5840 INCREASE
5840 5872 INCREASE
5872 5879 INCREASE
5879 5891 INCREASE
5891 5901 INCREASE
5901 5907 INCREASE
5907 5894
5894 5896 INCREASE
5896 5902 INCREASE
5902 5938 INCREASE
5938 5949 INCREASE
5949 5964 INCREASE
5964 5963
5963 5966 INCREASE
5966 5968 INCREASE
5968 5976 INCREASE
5976 5991 INCREASE
5991 6005 INCREASE
6005 5996
5996 5980
5980 5960
5960 5958
5958 5963 INCREASE
5963 5989 INCREASE
5989 6016 INCREASE
6016 6044 INCREASE
6044 6054 INCREASE
6054 6062 INCREASE
6062 6076 INCREASE
6076 6094 INCREASE
6094 6116 INCREASE
6116 6129 INCREASE
6129 6135 INCREASE
6135 6147 INCREASE
6147 6161 INCREASE
6161 6178 INCREASE
6178 6180 INCREASE
6180 6183 INCREASE
6183 6193 INCREASE
6193 6208 INCREASE
6208 6220 INCREASE
6220 6248 INCREASE
6248 6299 INCREASE
6299 6355 INCREASE
6355 6398 INCREASE
6398 6419 INCREASE
6419 6441 INCREASE
6441 6453 INCREASE
6453 6462 INCREASE
6462 6465 INCREASE
6465 6467 INCREASE
6467 6471 INCREASE
6471 6489 INCREASE
6489 6529 INCREASE
6529 6558 INCREASE
6558 6572 INCREASE
6572 6567
6567 6574 INCREASE
6574 6581 INCREASE
6581 6594 INCREASE
6594 6606 INCREASE
6606 6619 INCREASE
6619 6624 INCREASE
6624 6629 INCREASE
6629 6643 INCREASE
6643 6660 INCREASE
6660 6678 INCREASE
6678 6686 INCREASE
6686 6699 INCREASE
6699 6715 INCREASE
6715 6731 INCREASE
6731 6734 INCREASE
6734 6733
6733 6748 INCREASE
6748 6767 INCREASE
6767 6786 INCREASE
6786 6783
6783 6782
6782 6782
6782 6808 INCREASE
6808 6841 INCREASE
6841 6873 INCREASE
6873 6883 INCREASE
6883 6878
6878 6873
6873 6872
6872 6877 INCREASE
6877 6882 INCREASE
6882 6879
6879 6904 INCREASE
6904 6932 INCREASE
6932 6966 INCREASE
6966 6979 INCREASE
6979 6992 INCREASE
6992 7008 INCREASE
7008 7049 INCREASE
7049 7087 INCREASE
7087 7122 INCREASE
7122 7126 INCREASE
7126 7160 INCREASE
7160 7202 INCREASE
7202 7247 INCREASE
7247 7281 INCREASE
7281 7307 INCREASE
7307 7329 INCREASE
7329 7334 INCREASE
7334 7339 INCREASE
7339 7360 INCREASE
7360 7380 INCREASE
7380 7400 INCREASE
7400 7420 INCREASE
7420 7439 INCREASE
7439 7460 INCREASE
7460 7479 INCREASE
7479 7498 INCREASE
7498 7515 INCREASE
7515 7540 INCREASE
7540 7565 INCREASE
7565 7590 INCREASE
7590 7618 INCREASE
7618 7651 INCREASE
7651 7699 INCREASE
7699 7724 INCREASE
7724 7744 INCREASE
7744 7760 INCREASE
7760 7807 INCREASE
7807 7858 INCREASE
7858 7901 INCREASE
7901 7907 INCREASE
7907 7913 INCREASE
7913 7918 INCREASE
7918 7936 INCREASE
7936 7954 INCREASE
7954 7967 INCREASE
7967 7971 INCREASE
7971 7971
7971 7975 INCREASE
7975 7980 INCREASE
7980 7992 INCREASE
7992 8011 INCREASE
8011 8021 INCREASE
8021 8036 INCREASE
8036 8045 INCREASE
8045 8072 INCREASE
8072 8082 INCREASE
8082 8090 INCREASE
8090 8105 INCREASE
8105 8108 INCREASE
8108 8114 INCREASE
8114 8103
8103 8112 INCREASE
8112 8121 INCREASE
8121 8136 INCREASE
8136 8148 INCREASE
8148 8164 INCREASE
8164 8188 INCREASE
8188 8227 INCREASE
8227 8259 INCREASE
8259 8285 INCREASE
8285 8296 INCREASE
8296 8310 INCREASE
8310 8329 INCREASE
8329 8361 INCREASE
8361 8398 INCREASE
8398 8422 INCREASE
8422 8426 INCREASE
8426 8422
8422 8422
8422 8429 INCREASE
8429 8438 INCREASE
8438 8475 INCREASE
8475 8513 INCREASE
8513 8554 INCREASE
8554 8551
8551 8556 INCREASE
8556 8566 INCREASE
8566 8595 INCREASE
8595 8625 INCREASE
8625 8646 INCREASE
8646 8649 INCREASE
8649 8642
8642 8634
8634 8637 INCREASE
8637 8646 INCREASE
8646 8655 INCREASE
8655 8667 INCREASE
8667 8679 INCREASE
8679 8691 INCREASE
8691 8690
8690 8692 INCREASE
8692 8692
8692 8677
8677 8661
8661 8654
8654 8699 INCREASE
8699 8737 INCREASE
8737 8769 INCREASE
8769 8788 INCREASE
8788 8810 INCREASE
8810 8832 INCREASE
8832 8842 INCREASE
8842 8841
8841 8841
8841 8840
8840 8846 INCREASE
8846 8857 INCREASE
8857 8867 INCREASE
8867 8878 INCREASE
8878 8877
8877 8876
8876 8874
8874 8880 INCREASE
8880 8881 INCREASE
8881 8888 INCREASE
8888 8901 INCREASE
8901 8927 INCREASE
8927 8947 INCREASE
8947 8958 INCREASE
8958 8966 INCREASE
8966 8974 INCREASE
8974 8992 INCREASE
8992 9007 INCREASE
9007 9023 INCREASE
9023 9029 INCREASE
9029 9049 INCREASE
9049 9071 INCREASE
9071 9095 INCREASE
9095 9103 INCREASE
9103 9130 INCREASE
9130 9155 INCREASE
9155 9180 INCREASE
9180 9181 INCREASE
9181 9186 INCREASE
9186 9194 INCREASE
9194 9249 INCREASE
9249 9307 INCREASE
9307 9367 INCREASE
9367 9382 INCREASE
9382 9387 INCREASE
9387 9384
9384 9377
9377 9373
9373 9367
9367 9368 INCREASE
9368 9378 INCREASE
9378 9396 INCREASE
9396 9415 INCREASE
9415 9426 INCREASE
9426 9437 INCREASE
9437 9482 INCREASE
9482 9533 INCREASE
9533 9587 INCREASE
9587 9600 INCREASE
9600 9607 INCREASE
9607 9608 INCREASE
9608 9613 INCREASE
9613 9618 INCREASE
9618 9628 INCREASE
9628 9623
9623 9635 INCREASE
9635 9657 INCREASE
9657 9693 INCREASE
9693 9732 INCREASE
9732 9756 INCREASE
9756 9793 INCREASE
9793 9810 INCREASE
9810 9833 INCREASE
9833 9839 INCREASE
9839 9845 INCREASE
9845 9863 INCREASE
9863 9896 INCREASE
9896 9933 INCREASE
9933 9958 INCREASE
9958 9983 INCREASE
9983 10003 INCREASE
10003 10018 INCREASE
10018 10025 INCREASE
10025 10017
10017 10011
10011 10029 INCREASE
10029 10062 INCREASE
10062 10096 INCREASE
10096 10097 INCREASE
10097 10104 INCREASE
10104 10105 INCREASE
10105 10129 INCREASE
10129 10148 INCREASE
10148 10176 INCREASE
10176 10187 INCREASE
10187 10195 INCREASE
10195 10184
10184 10179
10179 10176
10176 10185 INCREASE
10185 10195 INCREASE
10195 10208 INCREASE
10208 10228 INCREASE
10228 10238 INCREASE
10238 10267 INCREASE
10267 10302 INCREASE
10302 10341 INCREASE
10341 10359 INCREASE
10359 10385 INCREASE
10385 10413 INCREASE
10413 10440 INCREASE
10440 10452 INCREASE
10452 10459 INCREASE
10459 10463 INCREASE
10463 10475 INCREASE
10475 10497 INCREASE
10497 10531 INCREASE
10531 10568 INCREASE
10568 10619 INCREASE
10619 10663 INCREASE
10663 10695 INCREASE
10695 10717 INCREASE
10717 10716
10716 10711
10711 10694
10694 10698 INCREASE
10698 10702 INCREASE
10702 10709 INCREASE
10709 10717 INCREASE
10717 10724 INCREASE
10724 10735 INCREASE
10735 10753 INCREASE
10753 10746
10746 10747 INCREASE
10747 10740
10740 10756 INCREASE
10756 10762 INCREASE
10762 10769 INCREASE
10769 10780 INCREASE
10780 10786 INCREASE
10786 10785
10785 10800 INCREASE
10800 10817 INCREASE
10817 10845 INCREASE
10845 10855 INCREASE
10855 10878 INCREASE
10878 10899 INCREASE
10899 10920 INCREASE
10920 10931 INCREASE
10931 10950 INCREASE
10950 10975 INCREASE
10975 10991 INCREASE
10991 11009 INCREASE
11009 11029 INCREASE
11029 11068 INCREASE
11068 11105 INCREASE
11105 11143 INCREASE
11143 11170 INCREASE
11170 11186 INCREASE
11186 11199 INCREASE
11199 11208 INCREASE
11208 11217 INCREASE
11217 11233 INCREASE
11233 11250 INCREASE
11250 11270 INCREASE
11270 11284 INCREASE
11284 11300 INCREASE
11300 11315 INCREASE
11315 11326 INCREASE
11326 11363 INCREASE
11363 11404 INCREASE
11404 11431 INCREASE
11431 11429
11429 11419
11419 11424 INCREASE
11424 11430 INCREASE
11430 11444 INCREASE
11444 11452 INCREASE
11452 11459 INCREASE
11459 11461 INCREASE
11461 11469 INCREASE
11469 11477 INCREASE
11477 11481 INCREASE
11481 11490 INCREASE
11490 11499 INCREASE
11499 11511 INCREASE
11511 11507
11507 11503
11503 11500
11500 11504 INCREASE
11504 11510 INCREASE
11510 11524 INCREASE
11524 11541 INCREASE
11541 11556 INCREASE
11556 11569 INCREASE
11569 11584 INCREASE
11584 11601 INCREASE
11601 11611 INCREASE
11611 11620 INCREASE
11620 11627 INCREASE
11627 11636 INCREASE
11636 11669 INCREASE
11669 11702 INCREASE
11702 11733 INCREASE
11733 11736 INCREASE
11736 11750 INCREASE
11750 11764 INCREASE
11764 11809 INCREASE
11809 11845 INCREASE
11845 11883 INCREASE
11883 11902 INCREASE
11902 11936 INCREASE
11936 11973 INCREASE
11973 11993 INCREASE
11993 11979
11979 11938
11938 11902
11902 11875
11875 11879 INCREASE
11879 11881 INCREASE
11881 11895 INCREASE
11895 11895
11895 11897 INCREASE
11897 11909 INCREASE
11909 11929 INCREASE
11929 11949 INCREASE
11949 11955 INCREASE
11955 11962 INCREASE
11962 11975 INCREASE
11975 11997 INCREASE
11997 12021 INCREASE
12021 12042 INCREASE
12042 12054 INCREASE
12054 12062 INCREASE
12062 12083 INCREASE
12083 12118 INCREASE
12118 12156 INCREASE
12156 12180 INCREASE
12180 12199 INCREASE
12199 12216 INCREASE
12216 12231 INCREASE
12231 12235 INCREASE
12235 12243 INCREASE
12243 12265 INCREASE
12265 12289 INCREASE
12289 12307 INCREASE
12307 12312 INCREASE
12312 12319 INCREASE
12319 12322 INCREASE
12322 12329 INCREASE
12329 12332 INCREASE
12332 12345 INCREASE
12345 12340
12340 12344 INCREASE
12344 12342
12342 12353 INCREASE
12353 12367 INCREASE
12367 12372 INCREASE
12372 12388 INCREASE
12388 12390 INCREASE
12390 12400 INCREASE
12400 12401 INCREASE
12401 12378
12378 12333
12333 12287
12287 12269
12269 12273 INCREASE
12273 12277 INCREASE
12277 12285 INCREASE
12285 12295 INCREASE
12295 12314 INCREASE
12314 12346 INCREASE
12346 12374 INCREASE
12374 12412 INCREASE
12412 12433 INCREASE
12433 12456 INCREASE
12456 12462 INCREASE
12462 12471 INCREASE
12471 12498 INCREASE
12498 12523 INCREASE
12523 12548 INCREASE
12548 12560 INCREASE
12560 12601 INCREASE
12601 12633 INCREASE
12633 12660 INCREASE
12660 12657
12657 12685 INCREASE
12685 12721 INCREASE
12721 12760 INCREASE
12760 12771 INCREASE
12771 12774 INCREASE
12774 12789 INCREASE
12789 12825 INCREASE
12825 12861 INCREASE
12861 12890 INCREASE
12890 12902 INCREASE
12902 12924 INCREASE
12924 12935 INCREASE
12935 12945 INCREASE
12945 12953 INCREASE
12953 12969 INCREASE
12969 12971 INCREASE
12971 12965
12965 12966 INCREASE
12966 12981 INCREASE
12981 13039 INCREASE
13039 13087 INCREASE
13087 13143 INCREASE
13143 13163 INCREASE
13163 13183 INCREASE
13183 13198 INCREASE
13198 13207 INCREASE
13207 13209 INCREASE
13209 13215 INCREASE
13215 13225 INCREASE
13225 13243 INCREASE
13243 13255 INCREASE
13255 13267 INCREASE
13267 13276 INCREASE
13276 13301 INCREASE
13301 13321 INCREASE
13321 13341 INCREASE
13341 13351 INCREASE
13351 13371 INCREASE
13371 13406 INCREASE
13406 13434 INCREASE
13434 13453 INCREASE
13453 13465 INCREASE
13465 13477 INCREASE
13477 13494 INCREASE
13494 13515 INCREASE
13515 13536 INCREASE
13536 13554 INCREASE
13554 13561 INCREASE
13561 13576 INCREASE
13576 13591 INCREASE
13591 13623 INCREASE
13623 13648 INCREASE
13648 13675 INCREASE
13675 13684 INCREASE
13684 13692 INCREASE
13692 13706 INCREASE
13706 13721 INCREASE
13721 13732 INCREASE
13732 13732
13732 13734 INCREASE
13734 13756 INCREASE
13756 13779 INCREASE
13779 13818 INCREASE
13818 13843 INCREASE
13843 13867 INCREASE
13867 13874 INCREASE
13874 13881 INCREASE
13881 13902 INCREASE
13902 13921 INCREASE
13921 13949 INCREASE
13949 13972 INCREASE
13972 13997 INCREASE
13997 14021 INCREASE
14021 14018
14018 14049 INCREASE
14049 14068 INCREASE
14068 14108 INCREASE
14108 14118 INCREASE
14118 14133 INCREASE
14133 14143 INCREASE
14143 14147 INCREASE
14147 14151 INCREASE
14151 14162 INCREASE
14162 14187 INCREASE
14187 14227 INCREASE
14227 14266 INCREASE
14266 14285 INCREASE
14285 14286 INCREASE
14286 14285
14285 14280
14280 14275
14275 14268
14268 14271 INCREASE
14271 14274 INCREASE
14274 14278 INCREASE
14278 14287 INCREASE
14287 14296 INCREASE
14296 14304 INCREASE
14304 14313 INCREASE
14313 14319 INCREASE
14319 14325 INCREASE
14325 14329 INCREASE
14329 14337 INCREASE
14337 14342 INCREASE
14342 14343 INCREASE
14343 14343
14343 14348 INCREASE
14348 14362 INCREASE
14362 14368 INCREASE
14368 14376 INCREASE
14376 14381 INCREASE
14381 14405 INCREASE
14405 14442 INCREASE
14442 14474 INCREASE
14474 14493 INCREASE
14493 14495 INCREASE
14495 14496 INCREASE
14496 14511 INCREASE
14511 14528 INCREASE
14528 14540 INCREASE
14540 14543 INCREASE
14543 14547 INCREASE
14547 14568 INCREASE
14568 14589 INCREASE
14589 14634 INCREASE
14634 14668 INCREASE
14668 14702 INCREASE
14702 14709 INCREASE
14709 14716 INCREASE
14716 14721 INCREASE
14721 14726 INCREASE
14726 14730 INCREASE
14730 14727
14727 14683
14683 14640
14640 14615
14615 14631 INCREASE
14631 14657 INCREASE
14657 14674 INCREASE
14674 14692 INCREASE
14692 14711 INCREASE
14711 14727 INCREASE
14727 14745 INCREASE
14745 14758 INCREASE
14758 14769 INCREASE
14769 14777 INCREASE
14777 14769
14769 14777 INCREASE
14777 14776
14776 14790 INCREASE
14790 14790
14790 14804 INCREASE
14804 14812 INCREASE
14812 14825 INCREASE
14825 14833 INCREASE
14833 14850 INCREASE
14850 14862 INCREASE
14862 14875 INCREASE
14875 14879 INCREASE
14879 14884 INCREASE
14884 14892 INCREASE
14892 14900 INCREASE
14900 14900
14900 14896
14896 14893
14893 14876
14876 14862
14862 14870 INCREASE
14870 14899 INCREASE
14899 14927 INCREASE
14927 14933 INCREASE
14933 14941 INCREASE
14941 14948 INCREASE
14948 14973 INCREASE
14973 14980 INCREASE
14980 14997 INCREASE
14997 15018 INCREASE
15018 15049 INCREASE
15049 15086 INCREASE
15086 15112 INCREASE
15112 15116 INCREASE
15116 15101
15101 15072
15072 15073 INCREASE
15073 15086 INCREASE
15086 15108 INCREASE
15108 15138 INCREASE
15138 15159 INCREASE
15159 15173 INCREASE
15173 15177 INCREASE
15177 15159
15159 15147
15147 15137
15137 15176 INCREASE
15176 15210 INCREASE
15210 15246 INCREASE
15246 15255 INCREASE
15255 15238
15238 15219
15219 15199
15199 15218 INCREASE
15218 15248 INCREASE
15248 15282 INCREASE
15282 15300 INCREASE
15300 15290
15290 15278
15278 15266
15266 15267 INCREASE
15267 15267
15267 15270 INCREASE
15270 15286 INCREASE
15286 15305 INCREASE
15305 15324 INCREASE
15324 15336 INCREASE
15336 15340 INCREASE
15340 15343 INCREASE
15343 15330
15330 15337 INCREASE
15337 15345 INCREASE
15345 15359 INCREASE
15359 15343
15343 15347 INCREASE
15347 15357 INCREASE
15357 15381 INCREASE
15381 15376
15376 15372
15372 15368
15368 15374 INCREASE
15374 15380 INCREASE
15380 15387 INCREASE
15387 15392 INCREASE
15392 15400 INCREASE
15400 15410 INCREASE
15410 15442 INCREASE
15442 15483 INCREASE
15483 15526 INCREASE
15526 15558 INCREASE
15558 15591 INCREASE
15591 15617 INCREASE
15617 15639 INCREASE
15639 15647 INCREASE
15647 15687 INCREASE
15687 15720 INCREASE
15720 15761 INCREASE
15761 15761
15761 15766 INCREASE
15766 15759
15759 15760 INCREASE
15760 15747
15747 15738
15738 15732
15732 15745 INCREASE
15745 15762 INCREASE
15762 15779 INCREASE
15779 15789 INCREASE
15789 15797 INCREASE
15797 15805 INCREASE
15805 15815 INCREASE
15815 15837 INCREASE
15837 15866 INCREASE
15866 15890 INCREASE
15890 15914 INCREASE
15914 15932 INCREASE
15932 15952 INCREASE
15952 15958 INCREASE
15958 15963 INCREASE
15963 15967 INCREASE
15967 15979 INCREASE
15979 15987 INCREASE
15987 16022 INCREASE
16022 16051 INCREASE
16051 16104 INCREASE
16104 16131 INCREASE
16131 16158 INCREASE
16158 16166 INCREASE
16166 16192 INCREASE
16192 16216 INCREASE
16216 16240 INCREASE
16240 16266 INCREASE
16266 16292 INCREASE
16292 16318 INCREASE
16318 16339 INCREASE
16339 16360 INCREASE
16360 16378 INCREASE
16378 16384 INCREASE
16384 16385 INCREASE
16385 16389 INCREASE
16389 16390 INCREASE
16390 16399 INCREASE
16399 16403 INCREASE
16403 16414 INCREASE
16414 16427 INCREASE
16427 16445 INCREASE
16445 16454 INCREASE
16454 16458 INCREASE
16458 16463 INCREASE
16463 16495 INCREASE
16495 16545 INCREASE
16545 16601 INCREASE
16601 16639 INCREASE
16639 16678 INCREASE
16678 16706 INCREASE
16706 16732 INCREASE
16732 16739 INCREASE
16739 16752 INCREASE
16752 16753 INCREASE
16753 16754 INCREASE
16754 16756 INCREASE
16756 16763 INCREASE
16763 16779 INCREASE
16779 16791 INCREASE
16791 16803 INCREASE
16803 16807 INCREASE
16807 16811 INCREASE
16811 16815 INCREASE
16815 16818 INCREASE
16818 16830 INCREASE
16830 16828
16828 16830 INCREASE
16830 16809
16809 16802
16802 16794
16794 16805 INCREASE
16805 16820 INCREASE
16820 16832 INCREASE
16832 16850 INCREASE
16850 16865 INCREASE
16865 16892 INCREASE
16892 16909 INCREASE
16909 16933 INCREASE
16933 16948 INCREASE
16948 16957 INCREASE
16957 16961 INCREASE
16961 16962 INCREASE
16962 16991 INCREASE
16991 17019 INCREASE
17019 17047 INCREASE
17047 17054 INCREASE
17054 17060 INCREASE
17060 17067 INCREASE
17067 17076 INCREASE
17076 17093 INCREASE
17093 17110 INCREASE
17110 17143 INCREASE
17143 17185 INCREASE
17185 17226 INCREASE
17226 17250 INCREASE
17250 17259 INCREASE
17259 17282 INCREASE
17282 17302 INCREASE
17302 17328 INCREASE
17328 17341 INCREASE
17341 17351 INCREASE
17351 17352 INCREASE
17352 17352
17352 17355 INCREASE
17355 17356 INCREASE
17356 17358 INCREASE
17358 17380 INCREASE
17380 17396 INCREASE
17396 17412 INCREASE
17412 17414 INCREASE
17414 17431 INCREASE
17431 17451 INCREASE
17451 17470 INCREASE
17470 17484 INCREASE
17484 17487 INCREASE
17487 17497 INCREASE
17497 17506 INCREASE
17506 17524 INCREASE
17524 17531 INCREASE
17531 17537 INCREASE
17537 17553 INCREASE
17553 17569 INCREASE
17569 17594 INCREASE
17594 17603 INCREASE
17603 17595
17595 17588
17588 17585
17585 17601 INCREASE
17601 17608 INCREASE
17608 17617 INCREASE
17617 17658 INCREASE
17658 17710 INCREASE
17710 17772 INCREASE
17772 17808 INCREASE
17808 17849 INCREASE
17849 17881 INCREASE
17881 17905 INCREASE
17905 17916 INCREASE
17916 17921 INCREASE
17921 17926 INCREASE
17926 17910
17910 17898
17898 17885
17885 17890 INCREASE
17890 17903 INCREASE
17903 17916 INCREASE
17916 17936 INCREASE
17936 17947 INCREASE
17947 17952 INCREASE
17952 17957 INCREASE
17957 17964 INCREASE
17964 17965 INCREASE
17965 17964
17964 17961
17961 17973 INCREASE
17973 17999 INCREASE
17999 18029 INCREASE
18029 18065 INCREASE
18065 18091 INCREASE
18091 18083
18083 18067
18067 18061
18061 18089 INCREASE
18089 18091 INCREASE
18091 18094 INCREASE
18094 18115 INCREASE
18115 18146 INCREASE
18146 18160 INCREASE
18160 18154
18154 18164 INCREASE
18164 18184 INCREASE
18184 18223 INCREASE
18223 18265 INCREASE
18265 18297 INCREASE
18297 18315 INCREASE
18315 18326 INCREASE
18326 18348 INCREASE
18348 18361 INCREASE
18361 18386 INCREASE
18386 18412 INCREASE
18412 18448 INCREASE
18448 18482 INCREASE
18482 18502 INCREASE
18502 18528 INCREASE
18528 18556 INCREASE
18556 18582 INCREASE
18582 18601 INCREASE
18601 18611 INCREASE
18611 18618 INCREASE
18618 18616
18616 18611
18611 18611
18611 18607
18607 18607
18607 18608 INCREASE
18608 18631 INCREASE
18631 18653 INCREASE
18653 18678 INCREASE
18678 18692 INCREASE
18692 18709 INCREASE
18709 18749 INCREASE
18749 18784 INCREASE
18784 18816 INCREASE
18816 18826 INCREASE
18826 18831 INCREASE
18831 18840 INCREASE
18840 18842 INCREASE
18842 18863 INCREASE
18863 18886 INCREASE
18886 18910 INCREASE
18910 18945 INCREASE
18945 18974 INCREASE
18974 19007 INCREASE
19007 19015 INCREASE
19015 19023 INCREASE
19023 19026 INCREASE
19026 19021
19021 19021
19021 19021
19021 19033 INCREASE
19033 19046 INCREASE
19046 19078 INCREASE
19078 19118 INCREASE
19118 19152 INCREASE
19152 19168 INCREASE
19168 19196 INCREASE
19196 19224 INCREASE
19224 19251 INCREASE
19251 19254 INCREASE
19254 19265 INCREASE
19265 19309 INCREASE
19309 19353 INCREASE
19353 19389 INCREASE
19389 19392 INCREASE
19392 19361
19361 19340
19340 19319
19319 19333 INCREASE
19333 19341 INCREASE
19341 19350 INCREASE
19350 19376 INCREASE
19376 19395 INCREASE
19395 19425 INCREASE
19425 19437 INCREASE
19437 19462 INCREASE
19462 19464 INCREASE
19464 19469 INCREASE
19469 19464
19464 19445
19445 19418
19418 19396
19396 19391
19391 19391
19391 19381
19381 19381
19381 19394 INCREASE
19394 19435 INCREASE
19435 19476 INCREASE
19476 19505 INCREASE
19505 19512 INCREASE
19512 19522 INCREASE
19522 19545 INCREASE
19545 19567 INCREASE
19567 19595 INCREASE
19595 19610 INCREASE
19610 19627 INCREASE
19627 19652 INCREASE
19652 19676 INCREASE
19676 19716 INCREASE
19716 19743 INCREASE
19743 19774 INCREASE
19774 19787 INCREASE
19787 19794 INCREASE
19794 19810 INCREASE
19810 19834 INCREASE
19834 19861 INCREASE
19861 19885 INCREASE
19885 19902 INCREASE
19902 19933 INCREASE
19933 19968 INCREASE
19968 20008 INCREASE
20008 20035 INCREASE
20035 20050 INCREASE
20050 20055 INCREASE
20055 20092 INCREASE
20092 20127 INCREASE
20127 20168 INCREASE
20168 20174 INCREASE
20174 20180 INCREASE
20180 20185 INCREASE
20185 20190 INCREASE
20190 20213 INCREASE
20213 20239 INCREASE
20239 20270 INCREASE
20270 20283 INCREASE
20283 20306 INCREASE
20306 20350 INCREASE
20350 20403 INCREASE
20403 20446 INCREASE
20446 20463 INCREASE
20463 20472 INCREASE
20472 20471
20471 20470
20470 20482 INCREASE
20482 20495 INCREASE
20495 20507 INCREASE
20507 20506
20506 20515 INCREASE
20515 20542 INCREASE
20542 20568 INCREASE
20568 20589 INCREASE
20589 20592 INCREASE
20592 20564
20564 20539
20539 20518
20518 20528 INCREASE
20528 20573 INCREASE
20573 20614 INCREASE
20614 20664 INCREASE
20664 20684 INCREASE
20684 20704 INCREASE
20704 20717 INCREASE
20717 20722 INCREASE
20722 20731 INCREASE
20731 20739 INCREASE
20739 20747 INCREASE
20747 20753 INCREASE
20753 20758 INCREASE
20758 20761 INCREASE
20761 20762 INCREASE
20762 20775 INCREASE
20775 20768
20768 20764
20764 20758
20758 20775 INCREASE
20775 20789 INCREASE
20789 20802 INCREASE
20802 20816 INCREASE
20816 20842 INCREASE
20842 20860 INCREASE
20860 20883 INCREASE
20883 20896 INCREASE
20896 20908 INCREASE
20908 20914 INCREASE
20914 20928 INCREASE
20928 20943 INCREASE
20943 20957 INCREASE
20957 20963 INCREASE
20963 20970 INCREASE
20970 20977 INCREASE
20977 21005 INCREASE
21005 21031 INCREASE
21031 21063 INCREASE
21063 21073 INCREASE
21073 21098 INCREASE
21098 21120 INCREASE
21120 21143 INCREASE
21143 21152 INCREASE
21152 21156 INCREASE
21156 21155
21155 21155
21155 21159 INCREASE
21159 21139
21139 21130
21130 21117
21117 21142 INCREASE
21142 21165 INCREASE
21165 21190 INCREASE
21190 21218 INCREASE
21218 21216
21216 21214
21214 21213
21213 21232 INCREASE
21232 21254 INCREASE
21254 21251
21251 21245
21245 21237
21237 21239 INCREASE
21239 21244 INCREASE
21244 21250 INCREASE
21250 21261 INCREASE
21261 21280 INCREASE
21280 21316 INCREASE
21316 21370 INCREASE
21370 21417 INCREASE
21417 21445 INCREASE
21445 21454 INCREASE
21454 21472 INCREASE
21472 21492 INCREASE
21492 21505 INCREASE
21505 21514 INCREASE
21514 21529 INCREASE
21529 21547 INCREASE
21547 21553 INCREASE
21553 21551
21551 21550
21550 21555 INCREASE
21555 21576 INCREASE
21576 21599 INCREASE
21599 21621 INCREASE
21621 21628 INCREASE
21628 21648 INCREASE
21648 21669 INCREASE
21669 21690 INCREASE
21690 21695 INCREASE
21695 21704 INCREASE
21704 21714 INCREASE
21714 21726 INCREASE
21726 21733 INCREASE
21733 21738 INCREASE
21738 21744 INCREASE
21744 21751 INCREASE
21751 21759 INCREASE
21759 21766 INCREASE
21766 21772 INCREASE
21772 21785 INCREASE
21785 21797 INCREASE
21797 21810 INCREASE
21810 21833 INCREASE
21833 21882 INCREASE
21882 21930 INCREASE
21930 21960 INCREASE
21960 21964 INCREASE
21964 21977 INCREASE
21977 22007 INCREASE
22007 22027 INCREASE
22027 22043 INCREASE
22043 22058 INCREASE
22058 22093 INCREASE
22093 22127 INCREASE
22127 22145 INCREASE
22145 22148 INCREASE
22148 22142
22142 22137
22137 22139 INCREASE
22139 22148 INCREASE
22148 22170 INCREASE
22170 22197 INCREASE
22197 22249 INCREASE
22249 22289 INCREASE
22289 22322 INCREASE
22322 22328 INCREASE
22328 22333 INCREASE
22333 22335 INCREASE
22335 22337 INCREASE
22337 22339 INCREASE
22339 22353 INCREASE
22353 22369 INCREASE
22369 22378 INCREASE
22378 22380 INCREASE
22380 22380
22380 22389 INCREASE
22389 22405 INCREASE
22405 22432 INCREASE
22432 22463 INCREASE
22463 22486 INCREASE
22486 22498 INCREASE
22498 22524 INCREASE
22524 22548 INCREASE
22548 22574 INCREASE
22574 22587 INCREASE
22587 22601 INCREASE
22601 22613 INCREASE
22613 22618 INCREASE
22618 22613
22613 22610
22610 22608
22608 22622 INCREASE
22622 22653 INCREASE
22653 22662 INCREASE
22662 22659
22659 22638
22638 22638
22638 22657 INCREASE
22657 22675 INCREASE
22675 22698 INCREASE
22698 22718 INCREASE
22718 22739 INCREASE
22739 22762 INCREASE
22762 22776 INCREASE
22776 22796 INCREASE
22796 22808 INCREASE
22808 22844 INCREASE
22844 22894 INCREASE
22894 22944 INCREASE
22944 22971 INCREASE
22971 22988 INCREASE
22988 23008 INCREASE
23008 23032 INCREASE
23032 23046 INCREASE
23046 23057 INCREASE
23057 23061 INCREASE
23061 23064 INCREASE
23064 23058
23058 23050
23050 23052 INCREASE
23052 23061 INCREASE
23061 23092 INCREASE
23092 23126 INCREASE
23126 23162 INCREASE
23162 23180 INCREASE
23180 23196 INCREASE
23196 23214 INCREASE
23214 23230 INCREASE
23230 23261 INCREASE
23261 23290 INCREASE
23290 23331 INCREASE
23331 23341 INCREASE
23341 23351 INCREASE
23351 23353 INCREASE
23353 23365 INCREASE
23365 23377 INCREASE
23377 23392 INCREASE
23392 23402 INCREASE
23402 23420 INCREASE
23420 23434 INCREASE
23434 23478 INCREASE
23478 23523 INCREASE
23523 23555 INCREASE
23555 23563 INCREASE
23563 23563
23563 23574 INCREASE
23574 23577 INCREASE
23577 23596 INCREASE
23596 23614 INCREASE
23614 23634 INCREASE
23634 23658 INCREASE
23658 23711 INCREASE
23711 23767 INCREASE
23767 23803 INCREASE
23803 23816 INCREASE
23816 23826 INCREASE
23826 23838 INCREASE
23838 23848 INCREASE
23848 23858 INCREASE
23858 23862 INCREASE
23862 23864 INCREASE
23864 23877 INCREASE
23877 23894 INCREASE
23894 23911 INCREASE
23911 23917 INCREASE
23917 23918 INCREASE
23918 23920 INCREASE
23920 23937 INCREASE
23937 23955 INCREASE
23955 23974 INCREASE
23974 23968
23968 23967
23967 23975 INCREASE
23975 23998 INCREASE
23998 24025 INCREASE
24025 24042 INCREASE
24042 24063 INCREASE
24063 24076 INCREASE
24076 24109 INCREASE
24109 24137 INCREASE
24137 24160 INCREASE
24160 24171 INCREASE
24171 24179 INCREASE
24179 24192 INCREASE
24192 24198 INCREASE
24198 24215 INCREASE
24215 24244 INCREASE
24244 24273 INCREASE
24273 24296 INCREASE
24296 24307 INCREASE
24307 24318 INCREASE
24318 24316
24316 24331 INCREASE
24331 24352 INCREASE
24352 24402 INCREASE
24402 24448 INCREASE
24448 24475 INCREASE
24475 24481 INCREASE
24481 24492 INCREASE
24492 24503 INCREASE
24503 24517 INCREASE
24517 24512
24512 24506
24506 24509 INCREASE
24509 24520 INCREASE
24520 24548 INCREASE
24548 24580 INCREASE
24580 24610 INCREASE
24610 24633 INCREASE
24633 24639 INCREASE
24639 24647 INCREASE
24647 24656 INCREASE
24656 24651
24651 24625
24625 24623
24623 24635 INCREASE
24635 24683 INCREASE
24683 24715 INCREASE
24715 24749 INCREASE
24749 24759 INCREASE
24759 24738
24738 24722
24722 24706
24706 24712 INCREASE
24712 24715 INCREASE
24715 24723 INCREASE
24723 24731 INCREASE
24731 24735 INCREASE
24735 24752 INCREASE
24752 24787 INCREASE
24787 24822 INCREASE
24822 24843 INCREASE
24843 24851 INCREASE
24851 24859 INCREASE
24859 24860 INCREASE
24860 24859
24859 24858
24858 24874 INCREASE
24874 24890 INCREASE
24890 24907 INCREASE
24907 24926 INCREASE
24926 24942 INCREASE
24942 24965 INCREASE
24965 24978 INCREASE
24978 25003 INCREASE
25003 25021 INCREASE
25021 25061 INCREASE
25061 25094 INCREASE
25094 25136 INCREASE
25136 25170 INCREASE
25170 25207 INCREASE
25207 25234 INCREASE
25234 25245 INCREASE
25245 25227
25227 25176
25176 25112
25112 25069
25069 25067
25067 25078 INCREASE
25078 25094 INCREASE
25094 25107 INCREASE
25107 25126 INCREASE
25126 25160 INCREASE
25160 25190 INCREASE
25190 25215 INCREASE
25215 25218 INCREASE
25218 25224 INCREASE
25224 25236 INCREASE
25236 25253 INCREASE
25253 25269 INCREASE
25269 25283 INCREASE
25283 25294 INCREASE
25294 25306 INCREASE
25306 25315 INCREASE
25315 25328 INCREASE
25328 25325
25325 25325
25325 25321
25321 25336 INCREASE
25336 25346 INCREASE
25346 25375 INCREASE
25375 25397 INCREASE
25397 25444 INCREASE
25444 25476 INCREASE
25476 25499 INCREASE
25499 25481
25481 25461
25461 25476 INCREASE
25476 25498 INCREASE
25498 25520 INCREASE
25520 25522 INCREASE
25522 25536 INCREASE
25536 25552 INCREASE
25552 25564 INCREASE
25564 25571 INCREASE
25571 25576 INCREASE
25576 25583 INCREASE
25583 25610 INCREASE
25610 25635 INCREASE
25635 25657 INCREASE
25657 25661 INCREASE
25661 25667 INCREASE
25667 25680 INCREASE
25680 25693 INCREASE
25693 25705 INCREASE
25705 25709 INCREASE
25709 25714 INCREASE
25714 25718 INCREASE
25718 25724 INCREASE
25724 25729 INCREASE
25729 25734 INCREASE
25734 25743 INCREASE
25743 25761 INCREASE
25761 25779 INCREASE
25779 25809 INCREASE
25809 25830 INCREASE
25830 25853 INCREASE
25853 25861 INCREASE
25861 25869 INCREASE
25869 25876 INCREASE
25876 25881 INCREASE
25881 25898 INCREASE
25898 25914 INCREASE
25914 25933 INCREASE
25933 25953 INCREASE
25953 25974 INCREASE
25974 25991 INCREASE
25991 26008 INCREASE
26008 26030 INCREASE
26030 26050 INCREASE
26050 26082 INCREASE
26082 26110 INCREASE
26110 26143 INCREASE
26143 26152 INCREASE
26152 26162 INCREASE
26162 26170 INCREASE
26170 26185 INCREASE
26185 26197 INCREASE
26197 26248 INCREASE
26248 26291 INCREASE
26291 26335 INCREASE
26335 26341 INCREASE
26341 26342 INCREASE
26342 26350 INCREASE
26350 26356 INCREASE
26356 26402 INCREASE
26402 26441 INCREASE
26441 26489 INCREASE
26489 26535 INCREASE
26535 26581 INCREASE
26581 26618 INCREASE
26618 26628 INCREASE
26628 26653 INCREASE
26653 26681 INCREASE
26681 26671
26671 26657
26657 26640
26640 26658 INCREASE
26658 26689 INCREASE
26689 26713 INCREASE
26713 26734 INCREASE
26734 26731
26731 26737 INCREASE
26737 26741 INCREASE
26741 26751 INCREASE
26751 26763 INCREASE
26763 26790 INCREASE
26790 26847 INCREASE
26847 26894 INCREASE
26894 26940 INCREASE
26940 26935
26935 26942 INCREASE
26942 26930
26930 26960 INCREASE
26960 26987 INCREASE
26987 27023 INCREASE
27023 27044 INCREASE
27044 27063 INCREASE
27063 27080 INCREASE
27080 27085 INCREASE
27085 27101 INCREASE
27101 27130 INCREASE
27130 27172 INCREASE
27172 27207 INCREASE
27207 27234 INCREASE
27234 27250 INCREASE
27250 27263 INCREASE
27263 27274 INCREASE
27274 27287 INCREASE
27287 27301 INCREASE
27301 27320 INCREASE
27320 27342 INCREASE
27342 27371 INCREASE
27371 27431 INCREASE
27431 27479 INCREASE
27479 27517 INCREASE
27517 27516
27516 27516
27516 27523 INCREASE
27523 27533 INCREASE
27533 27550 INCREASE
27550 27561 INCREASE
27561 27574 INCREASE
27574 27583 INCREASE
27583 27591 INCREASE
27591 27597 INCREASE
27597 27610 INCREASE
27610 27643 INCREASE
27643 27673 INCREASE
27673 27706 INCREASE
27706 27731 INCREASE
27731 27756 INCREASE
27756 27772 INCREASE
27772 27779 INCREASE
27779 27787 INCREASE
27787 27792 INCREASE
27792 27787
27787 27795 INCREASE
27795 27813 INCREASE
27813 27840 INCREASE
27840 27836
27836 27828
27828 27805
27805 27797
27797 27793
27793 27815 INCREASE
27815 27839 INCREASE
27839 27855 INCREASE
27855 27860 INCREASE
27860 27865 INCREASE
27865 27870 INCREASE
27870 27874 INCREASE
27874 27866
27866 27860
27860 27853
27853 27860 INCREASE
27860 27862 INCREASE
27862 27865 INCREASE
27865 27867 INCREASE
27867 27869 INCREASE
27869 27870 INCREASE
27870 27878 INCREASE
27878 27891 INCREASE
27891 27917 INCREASE
27917 27935 INCREASE
27935 27975 INCREASE
27975 27996 INCREASE
27996 28018 INCREASE
28018 28016
28016 28020 INCREASE
28020 28023 INCREASE
28023 28054 INCREASE
28054 28086 INCREASE
28086 28118 INCREASE
28118 28120 INCREASE
28120 28121 INCREASE
28121 28123 INCREASE
28123 28134 INCREASE
28134 28150 INCREASE
28150 28197 INCREASE
28197 28237 INCREASE
28237 28274 INCREASE
28274 28280 INCREASE
28280 28286 INCREASE
28286 28290 INCREASE
28290 28293 INCREASE
28293 28297 INCREASE
28297 28331 INCREASE
28331 28372 INCREASE
28372 28412 INCREASE
28412 28425 INCREASE
28425 28434 INCREASE
28434 28443 INCREASE
28443 28450 INCREASE
28450 28437
28437 28425
28425 28381
28381 28369
28369 28365
28365 28386 INCREASE
28386 28403 INCREASE
28403 28411 INCREASE
28411 28430 INCREASE
28430 28431 INCREASE
28431 28432 INCREASE
28432 28430
28430 28437 INCREASE
28437 28445 INCREASE
28445 28459 INCREASE
28459 28477 INCREASE
28477 28499 INCREASE
28499 28515 INCREASE
28515 28525 INCREASE
28525 28530 INCREASE
28530 28545 INCREASE
28545 28564 INCREASE
28564 28611 INCREASE
28611 28658 INCREASE
28658 28705 INCREASE
28705 28726 INCREASE
28726 28736 INCREASE
28736 28742 INCREASE
28742 28750 INCREASE
28750 28763 INCREASE
28763 28799 INCREASE
28799 28850 INCREASE
28850 28902 INCREASE
28902 28933 INCREASE
28933 28945 INCREASE
28945 28948 INCREASE
28948 28954 INCREASE
28954 28950
28950 28949
28949 28946
28946 28965 INCREASE
28965 28976 INCREASE
28976 29021 INCREASE
29021 29059 INCREASE
29059 29133 INCREASE
29133 29186 INCREASE
29186 29234 INCREASE
29234 29254 INCREASE
29254 29258 INCREASE
29258 29262 INCREASE
29262 29270 INCREASE
29270 29278 INCREASE
29278 29289 INCREASE
29289 29312 INCREASE
29312 29339 INCREASE
29339 29339
29339 29322
29322 29301
29301 29306 INCREASE
29306 29324 INCREASE
29324 29345 INCREASE
29345 29366 INCREASE
29366 29388 INCREASE
29388 29420 INCREASE
29420 29451 INCREASE
29451 29474 INCREASE
29474 29497 INCREASE
29497 29521 INCREASE
29521 29548 INCREASE
29548 29562 INCREASE
29562 29575 INCREASE
29575 29591 INCREASE
29591 29603 INCREASE
29603 29616 INCREASE
29616 29630 INCREASE
29630 29640 INCREASE
29640 29645 INCREASE
29645 29649 INCREASE
29649 29662 INCREASE
29662 29678 INCREASE
29678 29683 INCREASE
29683 29692 INCREASE
29692 29709 INCREASE
29709 29733 INCREASE
29733 29762 INCREASE
29762 29814 INCREASE
29814 29866 INCREASE
29866 29909 INCREASE
29909 29919 INCREASE
29919 29921 INCREASE
29921 29923 INCREASE
29923 29940 INCREASE
29940 29955 INCREASE
29955 29975 INCREASE
29975 29980 INCREASE
29980 30015 INCREASE
30015 30044 INCREASE
30044 30075 INCREASE
30075 30079 INCREASE
30079 30094 INCREASE
30094 30109 INCREASE
30109 30121 INCREASE
30121 30122 INCREASE
30122 30125 INCREASE
1739
#+end_example
